app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        @sc = SchoolClass.find(params[:id])

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dd"], ["room_number", 0], ["created_at", "2021-09-15 06:25:40.327024"], ["updated_at", "2021-09-15 06:25:40.327024"]]
---
    def create
        @sc = SchoolClass.new(school_class_params(:title, :room_number))
        @sc.save