app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", ""], ["last_name", ""], ["created_at", "2021-09-15 06:23:31.064484"], ["updated_at", "2021-09-15 06:23:31.064484"]]
---
    def create
        @student = Student.new(students_params(:first_name, :last_name))
        @student.save